import
  ../../../../src/happyx


translatable:
  # ru - Russian
  # ja - Japanese
  # zh - Chinese
  # ko - Korean
  # fr - French
  "🌎 RoadMap":
    "ru" -> "🌎 Дорожная Карта"
    "ja" -> "🌎 ロードマップ"
    "zh" -> "🌎 路线图"
    "ko" -> "🌎 로드맵"
    "fr" -> "🌎 Map Feuille de route"
  "🔥 Sponsors":
    "ru" -> "🔥 Спонсоры"
    "ja" -> "🔥 スポンサー"
    "zh" -> "🔥 提案国"
    "ko" -> "🔥 스폰서"
    "fr" -> "🔥 Sponsors"
  "📕 Documentation":
    "ru" -> "📕 Документация"
    "ja" -> "📕 書"
    "zh" -> "📕 文件"
    "ko" -> "📕 문서"
    "fr" -> "📕 Documentation"
  "Source code":
    "ru" -> "Исходный код"
    "ja" -> "ソースコード"
    "zh" -> "源代码"
    "ko" -> "소스 코드"
    "fr" -> "Code source"
  "Powerful macro-oriented full-stack web framework":
    "ru" -> "Мощный макроориентированный полнофункциональный веб-фреймворк"
    "ja" -> "強力なマクロ指向のフルスタックwebフレームワーク"
    "zh" -> "强大的面向宏的全栈web框架"
    "ko" -> "강력한 매크로 지향 풀 스택 웹 프레임 워크"
    "fr" -> "Puissant framework Web complet orienté macro"
  "modern and powerful ready-to-product web framework":
    "ru" -> "современный и мощный готовый к использованию веб-фреймворк"
    "ja" -> "現代および強力な準備ができてプロダクト網のフレームワーク"
    "zh" -> "现代而强大的现成产品web框架"
    "ko" -> "현대적이고 강력한 제품 준비가 된 웹 프레임 워크"
    "fr" -> "framework Web prêt à l'emploi moderne et puissant"
  "metaprogramming":
    "ru" -> "метапрограммирование"
    "ja" -> "メタプログラミング"
    "zh" -> "元编程"
    "ko" -> "메타프로그래밍"
    "fr" -> "métaprogrammation"
  "HappyX based on metaprogramming":
    "ru" -> "HappyX основан на метапрограммировании"
    "ja" -> "メタプログラミングに基づくHappyX"
    "zh" -> "基于元编程的幸福"
    "ko" -> "메타프로그래밍 기반 해픽스"
    "fr" -> "HappyX basé sur la métaprogrammation"
  "so most part of code runs at compile-time.":
    "ru" -> "таким образом, большая часть кода выполняется во время компиляции."
    "ja" -> "したがって、コードのほとんどの部分はコンパイル時に実行されます。"
    "zh" -> "所以大部分代码在编译时运行。"
    "ko" -> "따라서 대부분의 코드는 컴파일 타임에 실행됩니다."
    "fr" -> "ainsi, la majeure partie du code s'exécute au moment de la compilation."
  "This means that HappyX is REALLY fastest web framework":
    "ru" -> "Это означает, что HappyX - действительно самый быстрый веб-фреймворк"
    "ja" -> "これは、HappyXが本当に最速のwebフレームワークであることを意味します"
    "zh" -> "这意味着HappyX真的是最快的web框架"
    "ko" -> "이 해픽스는 정말 빠른 웹 프레임 워크를 의미합니다"
    "fr" -> "Cela signifie que HappyX est le framework Web le plus rapide"
  "full-stack":
    "ru" -> "полный стек"
    "ja" -> "フルスタック"
    "zh" -> "全栈"
    "ko" -> "전체 스택"
    "fr" -> "pile complète"
  "HappyX is full-stack web framework":
    "ru" -> "HappyX - это полнофункциональный веб-фреймворк"
    "ja" -> "HappyXはフルスタックのwebフレームワークです"
    "zh" -> "HappyX是全栈web框架"
    "ko" -> "해픽스는 풀 스택 웹 프레임 워크입니다"
    "fr" -> "HappyX est un framework web complet"
  "so you shouldn't learn a new syntax/libraries/frameworks":
    "ru" -> "поэтому вам не следует изучать новый синтаксис / библиотеки / фреймворки"
    "ja" -> "したがって、新しい構文/ライブラリ/フレームワークを学ぶべきではありません"
    "zh" -> "所以你不应该学习新的语法/库/框架"
    "ko" -> "따라서 새로운 구문/라이브러리/프레임 워크를 배우면 안됩니다"
    "fr" -> "donc, vous ne devriez pas apprendre une nouvelle syntaxe / bibliothèques / frameworks"
  "to create modern and powerful web applications":
    "ru" -> "для создания современных и мощных веб-приложений"
    "ja" -> "最新かつ強力なwebアプリケーションを作成するには"
    "zh" -> "创建现代和强大的web应用程序"
    "ko" -> "현대적이고 강력한 웹 응용 프로그램을 만들려면"
    "fr" -> "pour créer des applications web modernes et puissantes"
  "ready-to-product":
    "ru" -> "готовый к использованию продукт"
    "ja" -> "すぐに使える製品"
    "zh" -> "现成产品"
    "ko" -> "제품 준비 완료"
    "fr" -> "prêt à l'emploi"
  "HappyX is ready-to-product web framework":
    "ru" -> "HappyX - это готовый к использованию веб-фреймворк"
    "ja" -> "HappyXはすぐに製品のwebフレームワークです"
    "zh" -> "幸福是现成的产品web框架"
    "ko" -> "해픽스는 제품 준비가 된 웹 프레임 워크입니다"
    "fr" -> "HappyX est un framework web prêt à l'emploi"
  "your company may use HappyX":
    "ru" -> "ваша компания может использовать HappyX"
    "ja" -> "あなたの会社はHappyXを使用することができます"
    "zh" -> "您的公司可能会使用HappyX"
    "ko" -> "회사는 해픽스를 사용할 수 있습니다"
    "fr" -> "votre entreprise peut utiliser HappyX"
  "SSR Example ⚡":
    "ru" -> "Пример SSR ⚡"
    "ja" -> "SSRの例 ⚡"
    "zh" -> "SSR示例 ⚡"
    "ko" -> "예를 들면 다음과 같습니다. ⚡"
    "fr" -> "Exemple de RSS ⚡"
  "SPA Example 🎴":
    "ru" -> "Пример SPA приложения 🎴"
    "ja" -> "スパの例¶ 🎴"
    "zh" -> "SPA的例子 🎴"
    "ko" -> "스파 예 🎴"
    "fr" -> "Exemple de SPA 🎴"
  "Server-side rendering application":
    "ru" -> "Серверное приложение для рендеринга"
    "ja" -> "サーバー側レンダリングアプリケーション"
    "zh" -> "服务器端渲染应用程序"
    "ko" -> "서버 측 렌더링 응용 프로그램"
    "fr" -> "Application de rendu côté serveur"
  "Single-page application":
    "ru" -> "Одностраничное приложение"
    "ja" -> "単一ページアプリケーション"
    "zh" -> "单页应用程序"
    "ko" -> "단일 페이지 응용 프로그램"
    "fr" -> "Demande d'une seule page"
  "FileResponse Example 📁":
    "ru" -> "Пример ответа на запрос файла 📁"
    "ja" -> "ファイル応答の例¶ 📁"
    "zh" -> "FileResponse示例 📁"
    "ko" -> "파일 응답 예제에는 다음과 같은 내용이 포함되어 있습니다.📁"
    "fr" -> "Exemple de Réponse de fichier 📁"
  "Respond file from server to client":
    "ru" -> "Файл ответа от сервера к клиенту"
    "ja" -> "サーバーからクライアントへのファイルの応答"
    "zh" -> "从服务器到客户端响应文件"
    "ko" -> "서버에서 클라이언트로 파일 응답"
    "fr" -> "Répondre le fichier du serveur au client"
  "Path Params In SSR ⚙":
    "ru" -> "Параметры пути в SSR ⚙"
    "ja" -> "SSRのパスパラメータ ⚙"
    "zh" -> "SSR中的路径参数 ⚙"
    "ko" -> "경로 파라미터를 사용하여 경로 파라미터를 사용하여 경로 파라미터를 만듭니다. ⚙"
    "fr" -> "Paramètres De Chemin Dans SSR ⚙"
  "PathParams in server-side rendering":
    "ru" -> "Параметры пути при рендеринге на стороне сервера"
    "ja" -> "サーバー側レンダリングでのPathParams"
    "zh" -> "服务器端渲染中的PathParams"
    "ko" -> "서버 측 렌더링의 경로 매개 변수"
    "fr" -> "Paramètres de chemin dans le rendu côté serveur"
  "Path Params In SPA ⚙":
    "ru" -> "Параметры пути в SPA приложении ⚙"
    "ja" -> "SPAのパスパラメータ¶"
    "zh" -> "Spa中的路径Params"
    "ko" -> "경로 Params 스파에서⚙"
    "fr" -> "Paramètres De Chemin À SPA ⚙"
  "PathParams in single-page application":
    "ru" -> "Параметры пути в одностраничном приложении"
    "ja" -> "シングルページアプリケーションのPathParams"
    "zh" -> "单页应用程序中的PathParams"
    "ko" -> "단일 페이지 응용 프로그램의 경로 매개 변수"
    "fr" -> "Paramètres de chemin dans une application d'une seule page"
  "One of the main features of HappyX is DSL ✌.":
    "ru" -> "Одной из главных особенностей HappyX является DSL ✌."
    "ja" -> "HappyXの主な機能の1つはDSL XTです。"
    "zh" -> "HappyX的主要功能之一是DSL✌。"
    "ko" -> "해픽스의 주요 특징 중 하나는 다음과 같습니다✌."
    "fr" -> "L'une des principales fonctionnalités d'HappyX est DSL xt✌."
  "DSL supports:":
    "ru" -> "Поддержка DSL:"
    "ja" -> "DSLサポート:"
    "zh" -> "DSL支持:"
    "ko" -> "지원:"
    "fr" -> "Supports DSL:"
  "Build HTML/CSS/JS":
    "ru" -> "Создание HTML/CSS/JS"
    "ja" -> "HTML/CSS/JSをビルドする"
    "zh" -> "构建HTML/CSS/JS"
    "ko" -> "쨩챌쨔챈쨀"
    "fr" -> "Construire HTML / CSS / JS"
  "Path Params":
    "ru" -> "Параметры пути"
    "ja" -> "パスパラメータ"
    "zh" -> "路径参数"
    "ko" -> "경로 매개 변수"
    "fr" -> "Paramètres du Chemin"
  "Routing/Mounting":
    "ru" -> "Прокладка/монтаж"
    "ja" -> "配線/取り付け"
    "zh" -> "布线/安装"
    "ko" -> "라우팅/마운팅"
    "fr" -> "Routage / Montage"
  "Make powerful full-stack apps with really same syntax ⚡":
    "ru" -> "Создавайте мощные полнофункциональные приложения с действительно одинаковым синтаксисом ⚡"
    "ja" -> "本当に同じ構文で強力なフルスタックアプリを作る ⚡"
    "zh" -> "用真正相同的语法制作强大的全栈应用程序 ⚡"
    "ko" -> "정말 동일한 구문으로 강력한 풀 스택 앱을 만드십시오.⚡"
    "fr" -> "Créez de puissantes applications full-stack avec la même syntaxe ⚡"
  "You can easily and effectively create powerful modern web apps ✌":
    "ru" -> "Вы можете легко и эффективно создавать мощные современные веб-приложения ✌"
    "ja" -> "あなたは簡単かつ効果的に強力な現代のwebアプリを作成することができます！✌"
    "zh" -> "您可以轻松有效地创建强大的现代web应用程序！✌"
    "ko" -> "강력한 최신 웹 앱을 쉽고 효과적으로 만들 수 있습니다."
    "fr" -> "Vous pouvez facilement et efficacement créer de puissantes applications Web modernes ✌"
  "You'll never have to learn new web frameworks again ✨":
    "ru" -> "Вам больше никогда не придется изучать новые веб-фреймворки ✨"
    "ja" -> "新しいwebフレームワークを再び学ぶ必要はありません！✨"
    "zh" -> "你再也不用学习新的web框架了！✨"
    "ko" -> "새로운 웹 프레임 워크를 다시 배울 필요가 없습니다.✨"
    "fr" -> "Vous n'aurez plus jamais à apprendre de nouveaux frameworks Web ✨"
  "HappyX goals is development speed ⚡, efficiency 🎴 and speed 🔥":
    "ru" -> "Цели HappyX - это скорость разработки ⚡, эффективность 🎴 и оперативность 🔥"
    "ja" -> "HappyXの目標は、開発スピード、効率、スピードです。"
    "zh" -> "快乐的目标是发展速度、效率和速度。"
    "ko" -> "해픽스의 목표는 개발 속도,효율성,속도입니다."
    "fr" -> "Les objectifs d'HappyX sont la vitesse de développement⚡, l'efficacité 🎴 et la rapidité 🔥"
  "General features 🛠":
    "ru" -> "Общие характеристики 🛠"
    "ja" -> "一般的な機能 🛠"
    "zh" -> "一般特征 🛠"
    "ko" -> "일반적인 기능에는 다음이 포함됩니다. 🛠"
    "fr" -> "Caractéristiques générales 🛠"
  "SPA/SSR Support ⚡":
    "ru" -> "Поддержка SPA/SSR ⚡"
    "ja" -> "SPA/SSRサポート⚡"
    "zh" -> "SPA/SSR支持 ⚡"
    "ko" -> "지원 SPA/SSR ⚡"
    "fr" -> "Prise en charge SPA / SSR ⚡"
  "Multiple HTTP Servers 👨‍🔬":
    "ru" -> "Несколько HTTP-серверов 👨‍🔬"
    "ja" -> "複数のHTTPサーバ 👨‍🔬"
    "zh" -> "多个HTTP服务器 👨‍🔬"
    "ko" -> "여러 HTTP 서버 👨‍🔬"
    "fr" -> "Plusieurs serveurs HTTP 👨‍🔬"
  "Hot Code Reloading 🔥":
    "ru" -> "Горячая перезагрузка кода 🔥"
    "ja" -> "ホットコードリローディング 🔥"
    "zh" -> "热代码重新加载 🔥"
    "ko" -> "핫 코드를 다시 로드 🔥"
    "fr" -> "Rechargement de Code à chaud 🔥"
  "Framework improvement ⚡":
    "ru" -> "Улучшение структуры ⚡"
    "ja" -> "フレームワークの改善⚡"
    "zh" -> "框架改进》⚡"
    "ko" -> "Framework 개선 ⚡"
    "fr" -> "Amélioration du cadre ⚡"
  "Additional HTTP Servers 👨‍🔬":
    "ru" -> "Дополнительные HTTP-серверы 👨‍🔬"
    "ja" -> "追加のHTTPサーバ 👨‍🔬"
    "zh" -> "其他HTTP服务器 👨‍🔬"
    "ko" -> "추가적인 HTTP 서버 👨‍🔬"
    "fr" -> "Serveurs HTTP supplémentaires 👨‍🔬"
  "Translatable Strings 🔥":
    "ru" -> "Переводимые строки 🔥"
    "ja" -> "翻訳可能な文字列 🔥"
    "zh" -> "可翻译字符串 🔥"
    "ko" -> "번역 가능한 문자열은 다음과 같습니다.🔥"
    "fr" -> "Cordes traduisibles 🔥"
  "Static Directories 📁":
    "ru" -> "Статические каталоги 📁"
    "ja" -> "静的ディレクトリ 📁"
    "zh" -> "静态目录 📁"
    "ko" -> "정 디렉토리 📁"
    "fr" -> "Répertoires Statiques 📁"
  "Components Update 🧩":
    "ru" -> "Обновление компонентов 🧩"
    "ja" -> "コンポーネント更新¶ 🧩"
    "zh" -> "组件更新 🧩"
    "ko" -> "구성 요소가 업데이트되는 이유는 무엇입니까? 🧩"
    "fr" -> "Mise à jour des composants 🧩"
  "Inheritance 👶":
    "ru" -> "Наследование 👶"
    "ja" -> "相続 👶"
    "zh" -> "继承 👶"
    "ko" -> "상속 👶"
    "fr" -> "L'héritage 👶"
  "Methods 📦":
    "ru" -> "Методы 📦"
    "ja" -> "法 📦"
    "zh" -> "方法 📦"
    "ko" -> "방법 📦"
    "fr" -> "Méthodes 📦"
  "Constructors ⚙":
    "ru" -> "Конструкторы ⚙"
    "ja" -> "コンストラクタ ⚙"
    "zh" -> "建造者 ⚙"
    "ko" -> "생성자 ⚙"
    "fr" -> "Constructeurs ⚙"
  "Nim v2.0 Support ⚡":
    "ru" -> "Поддержка Nim версии 2.0 ⚡"
    "ja" -> "Nim v2.0のサポート¶ ⚡"
    "zh" -> "Nim v2.0支持！⚡"
    "ko" -> "Nim v2.0 지원 ⚡"
    "fr" -> "Prise en charge de Nim v2.0 ⚡"
  "Automatic Docs Generation 📕":
    "ru" -> "Автоматическое создание документов 📕"
    "ja" -> "ドキュメントの自動生成 📕"
    "zh" -> "自动生成文档 📕"
    "ko" -> "자동적인 문서를 생성 📕"
    "fr" -> "Génération Automatique de Documents 📕"
  ".hpx files support ✨":
    "ru" -> "поддержка файлов .hpx ✨"
    "ja" -> ".hpxファイルのサポート ✨"
    "zh" -> ".hpx文件支持 ✨"
    "ko" -> ".2018 년 10 월 15 일에 확인함. ✨"
    "fr" -> ".prise en charge des fichiers hpx ✨"
  "Python Bindings":
    "ru" -> "Привязки Python"
    "ja" -> "Pythonバインディング"
    "zh" -> "Python绑定"
    "ko" -> "파이썬 바인딩"
    "fr" -> "Liaisons Python"
  "Introduction ✌":
    "ru" -> "Введение ✌"
    "ja" -> "導入 ✌"
    "zh" -> "介绍 ✌"
    "ko" -> "소개이드 ✌"
    "fr" -> "Introduction ✌"
  "What Is HappyX? 💡":
    "ru" -> "Что такое HappyX? 💡"
    "ja" -> "HappyXとは何ですか 💡"
    "zh" -> "什么是幸福 💡"
    "ko" -> "해픽스란? 💡"
    "fr" -> "Qu'Est-ce que HappyX? 💡"
  "🌐 Language":
    "ru" -> "🌐 Язык"
    "ja" -> "🌐 言語"
    "zh" -> "🌐 语言"
    "ko" -> "🌐 언어"
    "fr" -> "🌐 Langue"
  """
        is a macro-oriented full-stack web framework, written in Nim.
        This project has been under development since April 2023 and is continuously evolving.
        HappyX draws inspiration from notable web frameworks like Vue.js and FastAPI.
        """:
    "ru" -> """
        это макро-ориентированный полнофункциональный веб фреймворк, написанный на Nim.
        Этот проект развивается с апреля 2023-го года и продолжает улучшаться.
        HappyX вдохновлен такими веб фреймворками, как Vue.js и FastAPI.
        """
    "fr" -> """
        c'est un cadre web pleinement fonctionnel orienté macro, écrit en Nim.
        Ce projet est en développement depuis avril 2023 et continue de s'améliorer.
        HappyX est inspiré par des cadres web tels que Vue.js et FastAPI.
        """
    "ja" -> """
        これはNimで書かれたマクロ指向のフル機能ウェブフレームワークです。
        このプロジェクトは2023年4月から開発が進められており、ますます向上しています。
        HappyXはVue.jsやFastAPIのようなウェブフレームワークに触発されています。
        """
    "zh" -> """
        这是一个用Nim编写的宏导向的全功能Web框架。
        该项目从2023年4月开始开发，不断改进中。
        HappyX的设计灵感来源于诸如Vue.js和FastAPI之类的Web框架。
        """
    "ko" -> """
        이것은 Nim에서 작성된 매크로 지향적인 완전한 기능의 웹 프레임워크입니다.
        이 프로젝트는 2023년 4월부터 개발되어 계속 발전하고 있습니다.
        HappyX는 Vue.js와 FastAPI와 같은 웹 프레임워크에서 영감을 받았습니다.
        """
  "TIP":
    "ru" -> "совет"
    "ja" -> "ヒント"
    "zh" -> "小费"
    "ko" -> "팁"
    "fr" -> "ASTUCE"
  "HappyX works with Nim and Python so you can choose one of these languages to read this guide ✌":
    "ru" -> "HappyX работает с Nim и Python, поэтому вы можете выбрать один из этих языков для чтения этого руководства ✌"
    "ja" -> "HappyXはNimとPythonで動作するため、このガイドを読むためにこれらの言語のいずれかを選択できます！ ✌"
    "zh" -> "HappyX与Nim和Python一起工作，因此您可以选择其中一种语言来阅读本指南！ ✌"
    "ko" -> "해픽스는 님과 파이썬과 함께 작동하므로 이 가이드를 읽기 위해 이러한 언어 중 하나를 선택할 수 있습니다. ✌"
    "fr" -> "HappyX fonctionne avec Nim et Python, vous pouvez donc choisir l'un de ces langages pour lire ce guide ✌"
  "If you:":
    "ru" -> "Если ты:"
    "ja" -> "もしあなたが:"
    "zh" -> "如果你:"
    "ko" -> "만약 당신이:"
    "fr" -> "Si vous:"
  "are not keen on constantly \"switching\" your mindset from one language or web framework to another 🔥":
    "ru" -> "не стремитесь постоянно \"переключать\" свое мышление с одного языка или веб-фреймворка на другой 🔥"
    "ja" -> "ある言語やwebフレームワークから別の言語にあなたの考え方を常に\"切り替える\"ことに熱心ではありません！ 🔥"
    "zh" -> "不热衷于不断地 切换 你的思维方式从一种语言或web框架到另一种语言或web框架 🔥"
    "ko" -> "한 언어 또는 웹 프레임 워크에서 다른 언어 또는 웹 프레임 워크로의 사고 방식을 끊임없이\"전환\"하는 데 열중하지 않습니다. 🔥"
    "fr" -> "n'êtes pas désireux de\"changer\" constamment votre état d'esprit d'un langage ou d'un framework Web à un autre 🔥"
  "desire a lightweight web framework ⚡":
    "ru" -> "хотите легкий веб-фреймворк ⚡"
    "ja" -> "軽量なwebフレームワークを望む¶ ⚡"
    "zh" -> "渴望一个轻量级的web框架 ⚡"
    "ko" -> "가벼운 웹 프레임 워크를 원합니다. ⚡"
    "fr" -> "désirez un framework web léger ⚡"
  "seek a web framework with everything \"out of the box\" 📦":
    "ru" -> "ищите веб-фреймворк со всем \"из коробки\" 📦"
    "ja" -> "すべてのwebフレームワークを求める\"箱から出して\" 📦"
    "zh" -> "寻求一个web框架与一切\"开箱即用\" 📦"
    "ko" -> "모든 것을 가진 웹 프레임 워크를 찾으십시오\"상자 밖으로\" 📦."
    "fr" -> "cherchez un framework Web avec tout ce qui est \"prêt à l'emploi\" 📦"
  "Then, HappyX is the perfect fit for you. 😉":
    "ru" -> "Тогда HappyX идеально подходит для вас. 😉"
    "ja" -> "その後、HappyXはあなたにぴったりです。 😉"
    "zh" -> "那么，幸福是最适合你的。 😉"
    "ko" -> "그런 다음,해픽스는 당신을위한 완벽한 적합합니다. 😉"
    "fr" -> "Alors, HappyX est la solution idéale pour vous. 😉"
  "Features 🔥":
    "ru" -> "Особенности 🔥"
    "ja" -> "特徴 🔥"
    "zh" -> "特 🔥"
    "ko" -> "기능 🔥"
    "fr" -> "Caractéristiques 🔥"
  "Production-ready 🔌":
    "ru" -> "Готово к производству 🔌"
    "ja" -> "本番運用対応 🔌"
    "zh" -> "生产就绪 🔌"
    "fr" -> "Prêt pour la production 🔌"
    "ko" -> "프로덕션 레디 🔌"
  "Multiple server options 🌩":
    "ru" -> "Несколько вариантов сервера 🌩"
    "ja" -> "複数のサーバーオプション¶ 🌩"
    "zh" -> "多个服务器选项 🌩"
    "ko" -> "여러 서버 옵션 중 하나를 선택할 수 있습니다. 🌩"
    "fr" -> "Plusieurs options de serveur 🌩"
  "Support Single-page applications, Static site generation and Server-side rendering 💫":
    "ru" -> "Поддержка одностраничных приложений, генерации статических сайтов и рендеринга на стороне сервера 💫"
    "ja" -> "シングルページアプリケーション、静的サイト生成、サーバー側レンダリングをサポート¶ 💫"
    "zh" -> "支持单页应用，静态站点生成和服务器端渲染！💫"
    "ko" -> "단일 페이지 응용 프로그램,정적 사이트 생성 및 서버 측 렌더링을 지원합니다. 💫"
    "fr" -> "Prise en charge des applications monopages, de la génération de sites statiques et du rendu côté serveur 💫"
  "Own Domain-specific languages for HTML, CSS and JavaScript 🎴":
    "ru" -> "Собственные доменные языки для HTML, CSS и JavaScript 🎴"
    "ja" -> "HTML、CSS、JavaScript用の独自のドメイン固有言語¶ 🎴"
    "zh" -> "拥有Html、CSS和JavaScript的特定领域语言 🎴"
    "ko" -> "자신의 도메인에 대해서는 특정 언어 HTML,CSS and JavaScript 🎴"
    "fr" -> "Propres langages spécifiques au domaine pour HTML, CSS et JavaScript 🎴"
  "Hot code reloading (only for Single-page applications for now) ⚡":
    "ru" -> "Горячая перезагрузка кода (пока только для одностраничных приложений) ⚡"
    "ja" -> "ホットコードリローディング（今のところ単一ページのアプリケーションのみ）⚡"
    "zh" -> "热代码重新加载（目前仅适用于单页应用程序）⚡"
    "ko" -> "핫 코드 다시로드(지금은 단일 페이지 응용 프로그램에만 해당). ⚡"
    "fr" -> "Rechargement de code à chaud (uniquement pour les applications d'une seule page pour l'instant) ⚡"
  "Routing/mounting with path param validation 👮‍♀️":
    "ru" -> "Маршрутизация/монтирование с проверкой параметров пути 👮"
    "ja" -> "パスパラメータ検証によるルーティング/マウント 👮"
    "zh" -> "路由/安装与路径param验证 👮"
    "ko" -> "경로 매개 변수 유효성 검사를 사용하여 라우팅/마운팅하는 방법은 다음과 같습니다. 👮"
    "fr" -> "Routage / montage avec validation des paramètres de chemin ️ ️ 👮"
  "CLI for creating, serving and building your projects 💻":
    "ru" -> "CLI для создания, обслуживания и компоновки ваших проектов 💻"
    "ja" -> "プロジェクトを作成、提供、構築するためのCLI 💻"
    "zh" -> "创建、服务和构建项目的CLI 💻"
    "ko" -> "귀하의 프로젝트를 만들고,제공하고,구축하기 위해 귀하의 프로젝트를 만들고,봉사하고,구축 할 수 있습니다. 💻"
    "fr" -> "CLI pour créer, servir et construire vos projets 💻"
  "Request models that supports JSON, FormData, x-www-form-urlencoded and XML 👮‍♀️":
    "ru" -> "Модели запросов, поддерживающие JSON, FormData, x-www-form-urlencoded и XML 👮"
    "ja" -> "JSON、FormData、x-www-form-urlencodedおよびXMLをサポートするリクエストモデル👮‍♀️"
    "zh" -> "请求支持JSON、FormData、x-www-form-urlencoded和XML的模型👮‍♀️"
    "ko" -> "이 응용 프로그램은 사용자 정의 모델,사용자 정의 모델,사용자 정의 모델,사용자 정의 모델 및 사용자 정의 모델을 지원합니다.👮‍♀️"
    "fr" -> "Modèles de requête prenant en charge JSON, FormData, x-www-form-urlencoded et XML ️ ️👮‍♀️ "
  "Translating, logging, security, built-in UI and more other features \"out of the box\" 📦":
    "ru" -> "Перевод, ведение журнала, безопасность, встроенный пользовательский интерфейс и множество других функций \"из коробки\" 📦"
    "ja" -> "翻訳、ロギング、セキュリティ、組み込みのUIとより多くの他の機能\"箱から出して\"📦"
    "zh" -> "翻译，日志记录，安全，内置UI和更多其他功能\"开箱即用\"📦"
    "ko" -> "번역,로깅,보안,내장 된 사용자 인터페이스 및 기타 기타 기능\"상자 밖으로\"."
    "fr" -> "Traduction, journalisation, sécurité, interface utilisateur intégrée et plus d'autres fonctionnalité\"prêtes à l'emploi\""
  "Community 🌎":
    "ru" -> "Сообщество 🌎"
    "ja" -> "地域 🌎"
    "zh" -> "社会 🌎"
    "ko" -> "커뮤니티 🌎"
    "fr" -> "La communauté 🌎"
  "Maintainers":
    "ru" -> "Сопровождающие"
    "ja" -> "メンテナー"
    "zh" -> "维修人员"
    "ko" -> "관리자"
    "fr" -> "Mainteneurs"
  "Contributors":
    "ru" -> "Составители"
    "ja" -> "コントリビューター"
    "zh" -> "贡献者"
    "ko" -> "기여자"
    "fr" -> "Contributeurs"
  "Getting Started 💫":
    "ru" -> "Приступаем к работе 💫"
    "ja" -> "はじめに¶ 💫"
    "zh" -> "开始吧！💫"
    "ko" -> "시작하기 💫"
    "fr" -> "Pour commencer 💫"
  "User Guide 📖":
    "ru" -> "Руководство пользователя 📖"
    "ja" -> "ユーザーガイド¶ 📖"
    "zh" -> "用户指南 📖"
    "ko" -> "사용자 안내 📖"
    "fr" -> "Guide de l'utilisateur 📖"
  "General 🍍":
    "ru" -> "Общие 🍍"
    "ja" -> "一般 🍍"
    "zh" -> "一般 🍍"
    "ko" -> "일반 🍍"
    "fr" -> "Général 🍍"
  "Basics 📖":
    "ru" -> "Основы 📖"
    "ja" -> "基礎 📖"
    "zh" -> "基本 📖"
    "ko" -> "기본 📖"
    "fr" -> "Notions de base 📖"
  "HappyX Application 🍍":
    "ru" -> "Приложение HappyX 🍍"
    "ja" -> "HappyX アプリケーション 🍍"
    "zh" -> "HappyX 应用程序 🍍"
    "fr" -> "Application HappyX 🍍"
    "ko" -> "HappyX 애플리케이션 🍍"
  "📕 API Reference":
    "ru" -> "📕 Справочник по API"
    "ja" -> "📕 APIリファレンス"
    "zh" -> "📕 API参考文档"
    "fr" -> "📕 Référence de l'API"
    "ko" -> "📕 API 참조"
  "Before you begin, please make sure you have":
    "ru" -> "Прежде чем начать, убедитесь, что у вас есть"
    "ja" -> "開始する前に、以下を確認してください"
    "zh" -> "开始之前，请确保您已经"
    "fr" -> "Avant de commencer, assurez-vous d'avoir"
    "ko" -> "시작하기 전에 다음 사항을 확인하세요"
  "Nim programming language":
    "ru" -> "Язык программирования Nim"
    "ja" -> "Nimプログラミング言語"
    "zh" -> "Nim编程语言"
    "ko" -> "닌 프로그래밍 언어"
    "fr" -> "Langage de programmation Nim"
  " version 1.6.14 or higher installed, or ":
    "ru" -> " установлена версия 1.6.14 или выше, или "
    "ja" -> " バージョン1.6.14以上がインストールされているか、 "
    "zh" -> " 版本1.6.14或更高版本安装，或 "
    "ko" -> " 버전 1.6.14 이상 설치 또는 "
    "fr" -> " version 1.6.14 ou supérieure installée, ou "
  "Python programming language":
    "ru" -> "Язык программирования Python"
    "ja" -> "Pythonプログラミング言語"
    "zh" -> "Python编程语言"
    "ko" -> "파이썬 프로그래밍 언어"
    "fr" -> "Langage de programmation Python"
  " version 3.10 and above.":
    "ru" -> " версия 3.10 и выше."
    "ja" -> " バージョン3.10以上。"
    "zh" -> " 版本3.10及以上。"
    "ko" -> " 버전 3.10 이상."
    "fr" -> " version 3.10 et supérieure."
  "Installing 📥":
    "ru" -> "Установка 📥"
    "ja" -> "インストール中 📥"
    "zh" -> "正在安装 📥"
    "fr" -> "Installation en cours 📥"
    "ko" -> "설치 중 📥"
  "To install HappyX you can write this command":
    "ru" -> "Чтобы установить HappyX, вы можете написать эту команду"
    "ja" -> "HappyXをインストールするには、次のコマンドを書くことができます"
    "zh" -> "要安装HappyX，您可以编写此命令"
    "ko" -> "해픽스를 설치하려면이 명령을 쓸 수 있습니다"
    "fr" -> "Pour installer HappyX, vous pouvez écrire cette commande"
  "There is our first application. I show you ":
    "ru" -> "Вот наше первое приложение. Я покажу вам "
    "ja" -> "私たちの最初のアプリケーションがあります。 私はあなたを見せます "
    "zh" -> "有我们的第一个应用程序。 我指给你看 "
    "ko" -> "우리의 첫 번째 응용 프로그램이 있습니다. 내가 보여줘 "
    "fr" -> "Il y a notre première application. Je te montre "
  " example.":
    "ru" -> " пример."
    "ja" -> " 例を挙げてみます。"
    "zh" -> " 例子。"
    "ko" -> " 예."
    "fr" -> " exemple."
  "Run App ▶":
    "ru" -> "Запустите приложение ▶"
    "ja" -> "アプリの実行▶"
    "zh" -> "运行应用程序▶"
    "ko" -> "응용 프로그램을 실행하려면 응용 프로그램을 실행해야합니다▶"
    "fr" -> "Exécuter l'application ▶"
  "If you create Single-page application then you need ":
    "ru" -> "Если вы создаете одностраничное приложение, то вам нужно "
    "ja" -> "単一ページのアプリケーションを作成する場合は、次のものが必要です "
    "zh" -> "如果您创建单页应用程序，那么您需要 "
    "ko" -> "단일 페이지 응용 프로그램을 만드는 경우 다음이 필요합니다 "
    "fr" -> "Si vous créez une application d'une seule page, vous avez besoin de "
  "file:":
    "ru" -> "файл:"
    "ja" -> "ファイル:"
    "zh" -> "档案:"
    "ko" -> "파일:"
    "fr" -> "fichier:"
  "In this guide we create calculator app 🧮":
    "ru" -> "В этом руководстве мы создаем приложение-калькулятор 🧮"
    "ja" -> "このガイドでは、電卓アプリを作成します！ 🧮"
    "zh" -> "在本指南中，我们创建计算器应用程序！🧮"
    "ko" -> "이 가이드에서 우리는 계산기 응용 프로그램을 만들 수 있습니다. 🧮"
    "fr" -> "Dans ce guide, nous créons une application de calculatrice 🧮"
  "Create Application 📦":
    "ru" -> "Создать приложение 📦"
    "ja" -> "アプリケーションの作成 📦"
    "zh" -> "创建应用程序 📦"
    "ko" -> "응용 프로그램 만들기 응용 프로그램 만들기 응용 프로그램 만들기 📦"
    "fr" -> "Créer une Application 📦"
  "To create a new HappyX app you should use ":
    "ru" -> "Чтобы создать новое приложение HappyX, вы должны использовать "
    "ja" -> "新しいHappyXアプリを作成するには、次を使用する必要があります "
    "zh" -> "要创建一个新的HappyX应用程序，您应该使用 "
    "ko" -> "새로운 해픽스 앱을 만들려면 다음을 사용해야 합니다 "
    "fr" -> "Pour créer une nouvelle application HappyX, vous devez utiliser "
  " or follow project structure.":
    "ru" -> " или следуйте структуре проекта."
    "ja" -> " またはプロジェクト構造に従ってください。"
    "zh" -> " 或遵循项目结构。"
    "ko" -> " 또는 프로젝트 구조를 따르십시오."
    "fr" -> " ou suivez la structure du projet."
  "When you use CLI, HappyX do everything for you.":
    "ru" -> "Когда вы используете CLI, HappyX сделает все за вас."
    "ja" -> "あなたがCLIを使うとき、HappyXはあなたのためにすべてをします。"
    "zh" -> "当你使用CLI时，HappyX为你做一切。"
    "ko" -> "당신이 클리를 사용할 때,해픽스는 당신을 위해 모든 것을 할."
    "fr" -> "Lorsque vous utilisez CLI, HappyX fait tout pour vous."
  "Project Structure":
    "ru" -> "Структура проекта"
    "ja" -> "プロジェクト構造"
    "zh" -> "项目架构"
    "ko" -> "프로젝트 구조"
    "fr" -> "Structure du Projet"
  "Calculator Project 🧮":
    "ru" -> "Проект калькулятора 🧮"
    "ja" -> "電卓プロジェクト 🧮"
    "zh" -> "计算器项目 🧮"
    "ko" -> "프로젝트 계산기 🧮"
    "fr" -> "Projet de Calculatrice 🧮"
  "Import Library":
    "ru" -> "Импорт библиотеки"
    "ja" -> "ライブラリのインポート"
    "zh" -> "导入库"
    "ko" -> "라이브러리 가져오기"
    "fr" -> "Bibliothèque d'Importation"
  "To use ":
    "ru" -> "Использовать "
    "ja" -> "使用するには "
    "zh" -> "要使用 "
    "ko" -> "사용 방법 "
    "fr" -> "À utiliser "
  " on Nim we need to import it.":
    "ru" -> " в Nim нам нужно импортировать его."
    "ja" -> " Nimではインポートする必要があります。"
    "zh" -> " 在Nim上，我们需要导入它。"
    "ko" -> " 님에 우리는 그것을 가져올 필요가있다."
    "fr" -> " sur Nim, nous devons l'importer."
  "In this guide we need only ":
    "ru" -> "В этом руководстве нам нужно только "
    "ja" -> "このガイドでは、必要なのは "
    "zh" -> "在本指南中，我们只需要 "
    "ko" -> "이 가이드에서 우리는 필요 "
    "fr" -> "Dans ce guide, il suffit de "
  " function. So import it.":
    "ru" -> " функция. Так что импортируйте его."
    "ja" -> " 機能。 だからそれをインポートします。"
    "zh" -> " 函数。 所以导入它。"
    "ko" -> " 기능. 그래서 그것을 가져 오십시오."
    "fr" -> " fonction. Alors importez-le."
  "Next step is server declaration.":
    "ru" -> "Следующий шаг - объявление сервера."
    "ja" -> "次のステップはサーバー宣言です。"
    "zh" -> "下一步是服务器声明。"
    "ko" -> "다음 단계는 서버 선언입니다."
    "fr" -> "L'étape suivante est la déclaration du serveur."
  "Here we declare ":
    "ru" -> "Здесь мы заявляем "
    "ja" -> "ここで宣言します "
    "zh" -> "在这里我们声明 "
    "ko" -> "여기서 우리는 선언합니다 "
    "fr" -> "Ici, nous déclarons "
  " with ":
    "ru" -> " с "
    "ja" -> " と "
    "zh" -> " 与 "
    "ko" -> " 함께 "
    "fr" -> " avec "
  "IP-address":
    "ru" -> "IP-адрес"
    "ja" -> "IPアドレス"
    "zh" -> "IP地址"
    "ko" -> "주소"
    "fr" -> "Adresse IP"
  " and ":
    "ru" -> " и "
    "ja" -> " と "
    "zh" -> " 和 "
    "ko" -> " 그리고 "
    "fr" -> " et "
  "port":
    "ru" -> "порт"
    "ja" -> "港"
    "zh" -> "港口"
    "ko" -> "항구"
    "fr" -> "portuaire"
  "Next step is main app declaration.":
    "ru" -> "Следующий шаг - это объявление основного приложения."
    "ja" -> "次のステップはメインアプリ宣言です。"
    "zh" -> "下一步是主应用程序声明。"
    "ko" -> "다음 단계는 기본 앱 선언입니다."
    "fr" -> "L'étape suivante est la déclaration de l'application principale."
  "element ID":
    "ru" -> "идентификатор элемента"
    "ja" -> "要素ID"
    "zh" -> "元素ID"
    "ko" -> "요소 아이디"
    "fr" -> "ID d'ÉLÉMENT"
  " that will contain our app.":
    "ru" -> " который будет содержать наше приложение."
    "ja" -> " それには私たちのアプリが含まれます。"
    "zh" -> " 这将包含我们的应用程序。"
    "ko" -> " 그것은 우리의 앱을 포함 할 것입니다."
    "fr" -> " cela contiendra notre application."
  "Here we declare server with ":
    "ru" -> "Здесь мы объявляем сервер с "
    "ja" -> "ここでは、サーバーを宣言します "
    "zh" -> "在这里，我们声明服务器与 "
    "ko" -> "여기서 우리는 다음과 함께 서버를 선언합니다 "
    "fr" -> "Ici, nous déclarons le serveur avec "
  " route.":
    "ru" -> " маршрут."
    "ja" -> " ルート。"
    "zh" -> " 路线。"
    "ko" -> " 경로."
    "fr" -> " itinéraire."
  "Next we create ":
    "ru" -> "Далее мы создаем "
    "ja" -> "次に作成します "
    "zh" -> "接下来我们创建 "
    "ko" -> "다음으로 우리는 "
    "fr" -> "Ensuite, nous créons "
  "Here we declare route that contains three path params.":
    "ru" -> "Здесь мы объявляем маршрут, содержащий три параметра пути."
    "ja" -> "ここでは、3つのパスパラメータを含むルートを宣言します。"
    "zh" -> "这里我们声明包含三个路径参数的路由。"
    "ko" -> "여기서 우리는 세 개의 경로 매개 변수가 포함 된 경로를 선언합니다."
    "fr" -> "Ici, nous déclarons une route qui contient trois paramètres de chemin."
  "Server ✨":
    "ru" -> "Сервер ✨"
    "ja" -> "サーバー ✨"
    "zh" -> "服务器 ✨"
    "ko" -> "서버에 저희 유영배라는 이모부의 친구가 만 ✨"
    "fr" -> "Serveur ✨"
  "Web App ✨":
    "ru" -> "Веб-приложение ✨"
    "ja" -> "ウェブアプリ✨"
    "zh" -> "Web应用程序✨"
    "ko" -> "웹 앱은 저희 유영배라는 이모부의 친구가 만✨"
    "fr" -> "Application Web ✨"
  "Calculation 🧮":
    "ru" -> "Расчет 🧮"
    "ja" -> "計算 🧮"
    "zh" -> "计算 🧮"
    "ko" -> "계산 🧮"
    "fr" -> "Calcul 🧮"
  "Path Params 🔌":
    "ru" -> "Параметры пути 🔌"
    "ja" -> "パスパラメータ 🔌"
    "zh" -> "路径参数 🔌"
    "ko" -> "경로 매개 변수 🔌"
    "fr" -> "Paramètres du Chemin 🔌"
  "Routing 🛠":
    "ru" -> "Маршрутизация 🛠"
    "ja" -> "ルーティング 🛠"
    "zh" -> "路由 🛠"
    "ko" -> "라우팅 🛠"
    "fr" -> "Routage 🛠"
  "HappyX provides powerful routing system. Here contains these features:":
    "ru" -> "HappyX обеспечивает мощную систему маршрутизацию. В нее входят:"
    "ja" -> "HappyXは強力なルーティングシステムを提供します。 これらの機能が含まれている場所:"
    "zh" -> "HappyX提供强大的路由系统。 其中包含这些功能:"
    "ko" -> "해픽스는 강력한 라우팅 시스템을 제공합니다. 이 특징들이 포함된 곳:"
    "fr" -> "HappyX fournit un système de routage puissant. Où contient ces fonctionnalités:"
  "Path param validation (int/float/string/etc) 👮‍♀️":
    "ru" -> "Проверка параметров пути (int/float/string/etc) 👮‍♀️"
    "ja" -> "パスパラメータの検証(int/float/string/etc) 👮‍♀️"
    "zh" -> "路径参数验证（int/float/string/etc）️️ 👮‍♀️"
    "ko" -> "이 매개 변수 유효성 검사를 수행 할 수있는 방법은 다음과 같습니다. 👮‍♀️"
    "fr" -> "Validation du paramètre de chemin (int/float/string/etc) 👮‍♀️"
  "Automatic [im]mutable variable creation ✨":
    "ru" -> "Автоматическое создание (не)изменяемой переменной ✨"
    "ja" -> "(非)可変変数の自動作成 ✨"
    "zh" -> "自动创建（非）可变变量 ✨"
    "ko" -> "(비)가변 변수의 자동 생성 ✨"
    "fr" -> "Création automatique d'une variable (non)modifiable ✨"
  "Supports by SPA/SSR and Nim/Python 👑":
    "ru" -> "Поддерживается в SPA/SSR и в Nim/Python 👑"
    "ja" -> "SPA/SSRおよびNim/Pythonによるサポート 👑"
    "zh" -> "SPA/SSR和Nim/Python支持 👑"
    "ko" -> "지원 및 지원 👑"
    "fr" -> "Prise en charge par SPA/SSR et Nim/Python 👑"
  "Request models support 🛠":
    "ru" -> "Поддержка моделей запросов 🛠"
    "ja" -> "モデルのサポートを要求する 🛠"
    "zh" -> "请求模型支持 🛠"
    "ko" -> "모델 지원 요청 🛠"
    "fr" -> "Demander le support des modèles 🛠"
  "Route Param Types 📕":
    "ru" -> "Типы параметров маршрута 📕"
    "ja" -> "ルートパラメータタイプ 📕"
    "zh" -> "路由参数类型 📕"
    "ko" -> "경로 매개 변수 유형 📕"
    "fr" -> "Types de Paramètres de Route 📕"
  "Type":
    "ru" -> "Тип"
    "ja" -> "タイプ"
    "zh" -> "类型"
    "ko" -> "유형"
    "fr" -> "Type"
  "Usage":
    "ru" -> "Использование"
    "ja" -> "使用法"
    "zh" -> "使用方法"
    "ko" -> "사용"
    "fr" -> "Utilisation"
  "Usage alias":
    "ru" -> "Псевдоним использования"
    "ja" -> "使用方法エイリアス"
    "zh" -> "用法别名"
    "ko" -> "사용 별칭"
    "fr" -> "Alias d'utilisation"
  "Description":
    "ru" -> "Описание"
    "ja" -> "説明"
    "zh" -> "资料描述"
    "ko" -> "설명"
    "fr" -> "Description"
  "Parses param as integer value":
    "ru" -> "Принимает параметр как целочисленное значение"
    "ja" -> "パラメータを整数値として解析します"
    "zh" -> "将参数解析为整数值"
    "ko" -> "매개 변수를 정수 값으로 구문 분석"
    "fr" -> "Analyse le paramètre en tant que valeur entière"
  "Parses param as float value":
    "ru" -> "Принимает параметр как число с плавающей запятой"
    "ja" -> "パラメータをfloat値として解析します"
    "zh" -> "将参数解析为float值"
    "ko" -> "매개 변수를 플로트 값으로 구문 분석"
    "fr" -> "Analyse le paramètre en tant que valeur flottante"
  "Parses param as boolean value":
    "ru" -> "Разбирает параметр как логическое значение"
    "ja" -> "paramをブール値として解析します"
    "zh" -> "解析参数为布尔值"
    "fr" -> "Analyse le paramètre comme une valeur booléenne"
    "ko" -> "매개변수를 부울 값으로 구문 분석합니다"
  "Parses param as word (only \\w+)":
    "ru" -> "Разбирает параметр как слово (только \\w+)"
    "ja" -> "paramを単語として解析します（\\w+のみ）"
    "zh" -> "解析参数为单词（仅限 \\w+）"
    "fr" -> "Analyse le paramètre comme un mot (seulement \\w+)"
    "ko" -> "매개변수를 단어로 구문 분석합니다 (\\w+만)"
  "Parses param as string (any character exclude '/')":
    "ru" -> "Разбирает параметр как строку (любой символ, исключая '/')"
    "ja" -> "paramを文字列として解析します（'/'を除く任意の文字）"
    "zh" -> "解析参数为字符串（任何字符，除了'/'）"
    "fr" -> "Analyse le paramètre comme une chaîne de caractères (tout caractère sauf '/')"
    "ko" -> "매개변수를 문자열로 구문 분석합니다 ('/'를 제외한 모든 문자)"
  "Parses param as string (any character include '/')":
    "ru" -> "Разбирает параметр как строку (любой символ, включая '/')"
    "ja" -> "paramを文字列として解析します（'/'を含む任意の文字）"
    "zh" -> "解析参数为字符串（包括'/'的任何字符）"
    "fr" -> "Analyse le paramètre comme une chaîne de caractères (tout caractère inclus '/')"
    "ko" -> "매개변수를 문자열로 구문 분석합니다 ('/'를 포함한 모든 문자)"
  "Parses param as Nim enum type (allow only for string enums)":
    "ru" -> "Разбирает параметр как перечисление типа Nim (разрешены только строковые перечисления)"
    "ja" -> "paramをNimの列挙型として解析します（文字列の列挙型のみ許可）"
    "zh" -> "解析参数为Nim枚举类型（仅允许字符串枚举）"
    "fr" -> "Analyse le paramètre comme un type énuméré Nim (autorise uniquement les énumérations de chaînes de caractères)"
    "ko" -> "매개변수를 Nim 열거형 타입으로 구문 분석합니다 (문자열 열거형만 허용)"
  "Parses param as string with regex pattern":
    "ru" -> "Разбирает параметр как строку с шаблоном регулярного выражения"
    "ja" -> "paramを正規表現パターンを含む文字列として解析します"
    "zh" -> "解析参数为带有正则表达式模式的字符串"
    "fr" -> "Analyse le paramètre comme une chaîne de caractères avec un motif regex"
    "ko" -> "매개변수를 정규식 패턴을 포함한 문자열로 구문 분석합니다"
  "In addition, you can define your own parameter types ✌":
    "ru" -> "Кроме того, вы можете определить собственные типы параметров ✌"
    "ja" -> "さらに、独自のパラメータータイプを定義することができます ✌"
    "zh" -> "此外，您可以定义自己的参数类型 ✌"
    "fr" -> "De plus, vous pouvez définir vos propres types de paramètres ✌"
    "ko" -> "또한, 자체 매개변수 유형을 정의할 수 있습니다 ✌"

var spokenLang: cstring
buildJs:
  ~spokenLang = localStorage["happyx_spoken_language"]
if spokenLang.len != 0:
  languageSettings.set($spokenLang)

var languages* = @[
  ("English", "en"),
  ("Русский", "ru"),
  ("Français", "fr"),
  ("日本語", "ja"),
  ("中文", "zh"),
  ("한국어", "ko"),
]

proc langTitles*: seq[string] =
  result = @[]
  for i in languages:
    result.add(i[0])
proc langCodes*: seq[string] =
  result = @[]
  for i in languages:
    result.add(i[1])
